f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_d.h
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// timer_d.h - Driver for the TIMER_D Module.
//
//*****************************************************************************

#ifndef __MSP430WARE_TIMER_D_H__
#define __MSP430WARE_TIMER_D_H__

#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_TxD7__

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

#include "inc/hw_regaccess.h"
//*****************************************************************************
//
// The following is a parameter used for Timer_D_getCounterValue that
// determines the maximum difference in counts of the TDxR register for a
// majority vote.
//
//*****************************************************************************
#define TIMER_D_THRESHOLD                                                    50

//*****************************************************************************
//
//! \brief Used in the Timer_D_initUpMode() function as the param parameter.
//
//*****************************************************************************
typedef struct Timer_D_initUpModeParam
{
    //! Selects Clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_EXTERNAL_TDCLK [Default]
    //! - \b TIMER_D_CLOCKSOURCE_ACLK
    //! - \b TIMER_D_CLOCKSOURCE_SMCLK
    //! - \b TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK
    uint16_t clockSource;
    //! Is the divider for clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_1 [Default]
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_2
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_3
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_4
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_5
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_6
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_7
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_8
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_10
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_12
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_14
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_16
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_20
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_24
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_28
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_32
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_40
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_48
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_56
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_64
    uint16_t clockSourceDivider;
    //! Is the selected clock mode register values.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKINGMODE_EXTERNAL_CLOCK [Default]
    //! - \b TIMER_D_CLOCKINGMODE_HIRES_LOCAL_CLOCK
    //! - \b TIMER_D_CLOCKINGMODE_AUXILIARY_CLK
    uint16_t clockingMode;
    //! Is the specified timer period. This is the value that gets written into
    //! the CCR0. Limited to 16 bits [uint16_t]
    uint16_t timerPeriod;
    //! Is to enable or disable timer interrupt
    //! \n Valid values are:
    //! - \b TIMER_D_TDIE_INTERRUPT_ENABLE
    //! - \b TIMER_D_TDIE_INTERRUPT_DISABLE [Default]
    uint16_t timerInterruptEnable_TDIE;
    //! Is to enable or disable timer CCR0 captureComapre interrupt.
    //! \n Valid values are:
    //! - \b TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE
    //! - \b TIMER_D_CCIE_CCR0_INTERRUPT_DISABLE [Default]
    uint16_t captureCompareInterruptEnable_CCR0_CCIE;
    //! Decides if timer clock divider, count direction, count need to be
    //! reset.
    //! \n Valid values are:
    //! - \b TIMER_D_DO_CLEAR
    //! - \b TIMER_D_SKIP_CLEAR [Default]
    uint16_t timerClear;
} Timer_D_initUpModeParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_initCompareMode() function as the param
//! parameter.
//
//*****************************************************************************
typedef struct Timer_D_initCompareModeParam
{
    //! Selects the Capture register being used.
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_0
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_1
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_2
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_3
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_4
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_5
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_6
    uint16_t compareRegister;
    //! Is to enable or disable timer captureComapre interrupt.
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURECOMPARE_INTERRUPT_ENABLE
    //! - \b TIMER_D_CAPTURECOMPARE_INTERRUPT_DISABLE [Default]
    uint16_t compareInterruptEnable;
    //! Specifies the output mode.
    //! \n Valid values are:
    //! - \b TIMER_D_OUTPUTMODE_OUTBITVALUE [Default]
    //! - \b TIMER_D_OUTPUTMODE_SET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_RESET
    //! - \b TIMER_D_OUTPUTMODE_SET_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE
    //! - \b TIMER_D_OUTPUTMODE_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_SET
    //! - \b TIMER_D_OUTPUTMODE_RESET_SET
    uint16_t compareOutputMode;
    //! Is the count to be compared with in compare mode
    uint16_t compareValue;
} Timer_D_initCompareModeParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_initContinuousMode() function as the param
//! parameter.
//
//*****************************************************************************
typedef struct Timer_D_initContinuousModeParam
{
    //! Selects Clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_EXTERNAL_TDCLK [Default]
    //! - \b TIMER_D_CLOCKSOURCE_ACLK
    //! - \b TIMER_D_CLOCKSOURCE_SMCLK
    //! - \b TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK
    uint16_t clockSource;
    //! Is the divider for clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_1 [Default]
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_2
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_3
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_4
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_5
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_6
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_7
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_8
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_10
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_12
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_14
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_16
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_20
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_24
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_28
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_32
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_40
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_48
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_56
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_64
    uint16_t clockSourceDivider;
    //! Is the selected clock mode register values.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKINGMODE_EXTERNAL_CLOCK [Default]
    //! - \b TIMER_D_CLOCKINGMODE_HIRES_LOCAL_CLOCK
    //! - \b TIMER_D_CLOCKINGMODE_AUXILIARY_CLK
    uint16_t clockingMode;
    //! Is to enable or disable timer interrupt
    //! \n Valid values are:
    //! - \b TIMER_D_TDIE_INTERRUPT_ENABLE
    //! - \b TIMER_D_TDIE_INTERRUPT_DISABLE [Default]
    uint16_t timerInterruptEnable_TDIE;
    //! Decides if timer clock divider, count direction, count need to be
    //! reset.
    //! \n Valid values are:
    //! - \b TIMER_D_DO_CLEAR
    //! - \b TIMER_D_SKIP_CLEAR [Default]
    uint16_t timerClear;
} Timer_D_initContinuousModeParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_initUpDownMode() function as the param
//! parameter.
//
//*****************************************************************************
typedef struct Timer_D_initUpDownModeParam
{
    //! Selects Clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_EXTERNAL_TDCLK [Default]
    //! - \b TIMER_D_CLOCKSOURCE_ACLK
    //! - \b TIMER_D_CLOCKSOURCE_SMCLK
    //! - \b TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK
    uint16_t clockSource;
    //! Is the divider for clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_1 [Default]
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_2
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_3
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_4
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_5
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_6
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_7
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_8
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_10
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_12
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_14
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_16
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_20
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_24
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_28
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_32
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_40
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_48
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_56
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_64
    uint16_t clockSourceDivider;
    //! Is the selected clock mode register values.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKINGMODE_EXTERNAL_CLOCK [Default]
    //! - \b TIMER_D_CLOCKINGMODE_HIRES_LOCAL_CLOCK
    //! - \b TIMER_D_CLOCKINGMODE_AUXILIARY_CLK
    uint16_t clockingMode;
    //! Is the specified timer period
    uint16_t timerPeriod;
    //! Is to enable or disable timer interrupt
    //! \n Valid values are:
    //! - \b TIMER_D_TDIE_INTERRUPT_ENABLE
    //! - \b TIMER_D_TDIE_INTERRUPT_DISABLE [Default]
    uint16_t timerInterruptEnable_TDIE;
    //! Is to enable or disable timer CCR0 captureComapre interrupt.
    //! \n Valid values are:
    //! - \b TIMER_D_CCIE_CCR0_INTERRUPT_ENABLE
    //! - \b TIMER_D_CCIE_CCR0_INTERRUPT_DISABLE [Default]
    uint16_t captureCompareInterruptEnable_CCR0_CCIE;
    //! Decides if timer clock divider, count direction, count need to be
    //! reset.
    //! \n Valid values are:
    //! - \b TIMER_D_DO_CLEAR
    //! - \b TIMER_D_SKIP_CLEAR [Default]
    uint16_t timerClear;
} Timer_D_initUpDownModeParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_initHighResGeneratorInRegulatedMode() function
//! as the param parameter.
//
//*****************************************************************************
typedef struct Timer_D_initHighResGeneratorInRegulatedModeParam
{
    //! Selects Clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_EXTERNAL_TDCLK [Default]
    //! - \b TIMER_D_CLOCKSOURCE_ACLK
    //! - \b TIMER_D_CLOCKSOURCE_SMCLK
    //! - \b TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK
    uint16_t clockSource;
    //! Is the divider for clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_1 [Default]
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_2
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_3
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_4
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_5
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_6
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_7
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_8
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_10
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_12
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_14
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_16
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_20
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_24
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_28
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_32
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_40
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_48
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_56
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_64
    uint16_t clockSourceDivider;
    //! Is the selected clock mode register values.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKINGMODE_EXTERNAL_CLOCK [Default]
    //! - \b TIMER_D_CLOCKINGMODE_HIRES_LOCAL_CLOCK
    //! - \b TIMER_D_CLOCKINGMODE_AUXILIARY_CLK
    uint16_t clockingMode;
    //! Selects the high resolution multiply factor.
    //! \n Valid values are:
    //! - \b TIMER_D_HIGHRES_CLK_MULTIPLY_FACTOR_8x
    //! - \b TIMER_D_HIGHRES_CLK_MULTIPLY_FACTOR_16x
    uint8_t highResClockMultiplyFactor;
    //! Selects the high resolution divider.
    //! \n Valid values are:
    //! - \b TIMER_D_HIGHRES_CLK_DIVIDER_1
    //! - \b TIMER_D_HIGHRES_CLK_DIVIDER_2
    //! - \b TIMER_D_HIGHRES_CLK_DIVIDER_4
    //! - \b TIMER_D_HIGHRES_CLK_DIVIDER_8
    uint8_t highResClockDivider;
} Timer_D_initHighResGeneratorInRegulatedModeParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_combineTDCCRToOutputPWM() function as the param
//! parameter.
//
//*****************************************************************************
typedef struct Timer_D_combineTDCCRToOutputPWMParam
{
    //! Selects Clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_EXTERNAL_TDCLK [Default]
    //! - \b TIMER_D_CLOCKSOURCE_ACLK
    //! - \b TIMER_D_CLOCKSOURCE_SMCLK
    //! - \b TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK
    uint16_t clockSource;
    //! Is the divider for clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_1 [Default]
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_2
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_3
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_4
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_5
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_6
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_7
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_8
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_10
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_12
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_14
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_16
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_20
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_24
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_28
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_32
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_40
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_48
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_56
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_64
    uint16_t clockSourceDivider;
    //! Is the selected clock mode register values.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKINGMODE_EXTERNAL_CLOCK [Default]
    //! - \b TIMER_D_CLOCKINGMODE_HIRES_LOCAL_CLOCK
    //! - \b TIMER_D_CLOCKINGMODE_AUXILIARY_CLK
    uint16_t clockingMode;
    //! Is the specified timer period
    uint16_t timerPeriod;
    //! Selects desired CCR registers to combine
    //! \n Valid values are:
    //! - \b TIMER_D_COMBINE_CCR1_CCR2
    //! - \b TIMER_D_COMBINE_CCR3_CCR4
    //! - \b TIMER_D_COMBINE_CCR5_CCR6
    uint16_t combineCCRRegistersCombination;
    //! Specifies the output mode.
    //! \n Valid values are:
    //! - \b TIMER_D_OUTPUTMODE_OUTBITVALUE [Default]
    //! - \b TIMER_D_OUTPUTMODE_SET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_RESET
    //! - \b TIMER_D_OUTPUTMODE_SET_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE
    //! - \b TIMER_D_OUTPUTMODE_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_SET
    //! - \b TIMER_D_OUTPUTMODE_RESET_SET
    uint16_t compareOutputMode;
    //! Specifies the dutycycle for the generated waveform
    uint16_t dutyCycle1;
    //! Specifies the dutycycle for the generated waveform
    uint16_t dutyCycle2;
} Timer_D_combineTDCCRToOutputPWMParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_initCaptureMode() function as the param
//! parameter.
//
//*****************************************************************************
typedef struct Timer_D_initCaptureModeParam
{
    //! Selects the Capture register being used. Refer to datasheet to ensure
    //! the device has the capture compare register being used
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_0
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_1
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_2
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_3
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_4
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_5
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_6
    uint16_t captureRegister;
    //! Is the capture mode selected.
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTUREMODE_NO_CAPTURE [Default]
    //! - \b TIMER_D_CAPTUREMODE_RISING_EDGE
    //! - \b TIMER_D_CAPTUREMODE_FALLING_EDGE
    //! - \b TIMER_D_CAPTUREMODE_RISING_AND_FALLING_EDGE
    uint16_t captureMode;
    //! Decides the Input Select
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURE_INPUTSELECT_CCIxA [Default]
    //! - \b TIMER_D_CAPTURE_INPUTSELECT_CCIxB
    //! - \b TIMER_D_CAPTURE_INPUTSELECT_GND
    //! - \b TIMER_D_CAPTURE_INPUTSELECT_Vcc
    uint16_t captureInputSelect;
    //! Decides if capture source should be synchronized with timer clock
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURE_ASYNCHRONOUS [Default]
    //! - \b TIMER_D_CAPTURE_SYNCHRONOUS
    uint16_t synchronizeCaptureSource;
    //! Is to enable or disabel capture interrupt
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURE_INTERRUPT_ENABLE
    //! - \b TIMER_D_CAPTURE_INTERRUPT_DISABLE [Default]
    uint16_t captureInterruptEnable;
    //! Specifies the output mode.
    //! \n Valid values are:
    //! - \b TIMER_D_OUTPUTMODE_OUTBITVALUE [Default]
    //! - \b TIMER_D_OUTPUTMODE_SET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_RESET
    //! - \b TIMER_D_OUTPUTMODE_SET_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE
    //! - \b TIMER_D_OUTPUTMODE_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_SET
    //! - \b TIMER_D_OUTPUTMODE_RESET_SET
    uint16_t captureOutputMode;
    //! Specifies single/dual capture mode.
    //! \n Valid values are:
    //! - \b TIMER_D_SINGLE_CAPTURE_MODE
    //! - \b TIMER_D_DUAL_CAPTURE_MODE
    uint8_t channelCaptureMode;
} Timer_D_initCaptureModeParam;

//*****************************************************************************
//
//! \brief Used in the Timer_D_outputPWM() function as the param parameter.
//
//*****************************************************************************
typedef struct Timer_D_outputPWMParam
{
    //! Selects Clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_EXTERNAL_TDCLK [Default]
    //! - \b TIMER_D_CLOCKSOURCE_ACLK
    //! - \b TIMER_D_CLOCKSOURCE_SMCLK
    //! - \b TIMER_D_CLOCKSOURCE_INVERTED_EXTERNAL_TDCLK
    uint16_t clockSource;
    //! Is the divider for clock source.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_1 [Default]
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_2
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_3
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_4
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_5
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_6
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_7
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_8
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_10
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_12
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_14
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_16
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_20
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_24
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_28
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_32
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_40
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_48
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_56
    //! - \b TIMER_D_CLOCKSOURCE_DIVIDER_64
    uint16_t clockSourceDivider;
    //! Is the selected clock mode register values.
    //! \n Valid values are:
    //! - \b TIMER_D_CLOCKINGMODE_EXTERNAL_CLOCK [Default]
    //! - \b TIMER_D_CLOCKINGMODE_HIRES_LOCAL_CLOCK
    //! - \b TIMER_D_CLOCKINGMODE_AUXILIARY_CLK
    uint16_t clockingMode;
    //! Is the specified timer period
    uint16_t timerPeriod;
    //! Selects the compare register being used.
    //! \n Valid values are:
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_0
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_1
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_2
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_3
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_4
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_5
    //! - \b TIMER_D_CAPTURECOMPARE_REGISTER_6
    uint16_t compareRegister;
    //! Specifies the output mode.
    //! \n Valid values are:
    //! - \b TIMER_D_OUTPUTMODE_OUTBITVALUE [Default]
    //! - \b TIMER_D_OUTPUTMODE_SET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_RESET
    //! - \b TIMER_D_OUTPUTMODE_SET_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE
    //! - \b TIMER_D_OUTPUTMODE_RESET
    //! - \b TIMER_D_OUTPUTMODE_TOGGLE_SET
    //! - \b TIMER_D_OUTPUTMODE_RESET_SET
    uint16_t compareOutputMode;
    //! Specifies the dutycycle for the generated waveform
    uint16_t dutyCycle;
} Timer_D_outputPWMParam;

