f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/timer_d.h
//*****************************************************************************
//
//! \brief Combine TDCCR to get PWM
//!
//! \param baseAddress is the base address of the TIMER_D module.
//! \param param is the pointer to struct for PWM generation using two CCRs.
//!
//! Modified bits of \b TDxCCTLn register, bits of \b TDxCCR0 register, bits of
//! \b TDxCCTL0 register, bits of \b TDxCTL0 register and bits of \b TDxCTL1
//! register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_combineTDCCRToOutputPWM(uint16_t baseAddress,
                                            Timer_D_combineTDCCRToOutputPWMParam *param);

//*****************************************************************************
//
//! \brief Selects Timer_D Latching Group
//!
//! \param baseAddress is the base address of the TIMER_D module.
//! \param groupLatch selects the group latch
//!        Valid values are:
//!        - \b TIMER_D_GROUP_NONE [Default]
//!        - \b TIMER_D_GROUP_CL12_CL23_CL56
//!        - \b TIMER_D_GROUP_CL123_CL456
//!        - \b TIMER_D_GROUP_ALL
//!
//! Modified bits are \b TDCLGRP of \b TDxCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_selectLatchingGroup(uint16_t baseAddress,
                                        uint16_t groupLatch);

//*****************************************************************************
//
//! \brief Selects Timer_D counter length
//!
//! \param baseAddress is the base address of the TIMER_D module.
//! \param counterLength selects the value of counter length.
//!        Valid values are:
//!        - \b TIMER_D_COUNTER_16BIT [Default]
//!        - \b TIMER_D_COUNTER_12BIT
//!        - \b TIMER_D_COUNTER_10BIT
//!        - \b TIMER_D_COUNTER_8BIT
//!
//! Modified bits are \b CNTL of \b TDxCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_selectCounterLength(uint16_t baseAddress,
                                        uint16_t counterLength);

//*****************************************************************************
//
//! \brief Selects Compare Latch Load Event
//!
//! \param baseAddress is the base address of the TIMER_D module.
//! \param compareRegister selects the compare register being used.
//!        Valid values are:
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_D_CAPTURECOMPARE_REGISTER_6
//! \param compareLatchLoadEvent selects the latch load event
//!        Valid values are:
//!        - \b TIMER_D_LATCH_ON_WRITE_TO_TDxCCRn_COMPARE_REGISTER [Default]
//!        - \b TIMER_D_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UP_OR_CONT_MODE
//!        - \b TIMER_D_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UPDOWN_MODE
//!        - \b
//!           TIMER_D_LATCH_WHEN_COUNTER_COUNTS_TO_CURRENT_COMPARE_LATCH_VALUE
//!
//! Modified bits are \b CLLD of \b TDxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_initCompareLatchLoadEvent(uint16_t baseAddress,
                                              uint16_t compareRegister,
                                              uint16_t compareLatchLoadEvent);

//*****************************************************************************
//
//! \brief Disable High Resolution fast wakeup
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! Modified bits are \b TDHFW of \b TDxHCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_disableHighResFastWakeup(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Enable High Resolution fast wakeup
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! Modified bits are \b TDHFW of \b TDxHCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_enableHighResFastWakeup(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Disable High Resolution Clock Enhanced Accuracy
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! Modified bits are \b TDHEAEN of \b TDxHCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_disableHighResClockEnhancedAccuracy(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Enable High Resolution Clock Enhanced Accuracy
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! Modified bits are \b TDHEAEN of \b TDxHCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_enableHighResClockEnhancedAccuracy(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Disable High Resolution Clock Enhanced Accuracy
//!
//! High-resolution generator is on if the Timer_D counter
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! Modified bits are \b TDHRON of \b TDxHCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_disableHighResGeneratorForceON(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Enable High Resolution Clock Enhanced Accuracy
//!
//! High-resolution generator is on in all Timer_D MCx modes. The PMM remains
//! in high-current mode.
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! Modified bits are \b TDHRON of \b TDxHCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_enableHighResGeneratorForceON(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Select High Resolution Coarse Clock Range
//!
//! \param baseAddress is the base address of the TIMER_D module.
//! \param highResCoarseClockRange selects the High Resolution Coarse Clock
//!        Range
//!        Valid values are:
//!        - \b TIMER_D_HIGHRES_BELOW_15MHz [Default]
//!        - \b TIMER_D_HIGHRES_ABOVE_15MHz
//!
//! Modified bits are \b TDHCLKCR of \b TDxHCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_selectHighResCoarseClockRange(uint16_t baseAddress,
                                                  uint16_t highResCoarseClockRange);

//*****************************************************************************
//
//! \brief Select High Resolution Clock Range Selection
//!
//! \param baseAddress is the base address of the TIMER_D module.
//! \param highResClockRange selects the High Resolution Clock Range. Refer to
//!        datasheet for frequency details
//!        Valid values are:
//!        - \b TIMER_D_CLOCK_RANGE0 [Default]
//!        - \b TIMER_D_CLOCK_RANGE1
//!        - \b TIMER_D_CLOCK_RANGE2
//!
//! \return None
//
//*****************************************************************************
extern void Timer_D_selectHighResClockRange(uint16_t baseAddress,
                                            uint16_t highResClockRange);

//*****************************************************************************
//
//! \brief Reads the current timer count value
//!
//! Reads the current count value of the timer. There is a majority vote system
//! in place to confirm an accurate value is returned. The Timer_D_THRESHOLD
//! #define in the corresponding header file can be modified so that the votes
//! must be closer together for a consensus to occur.
//!
//! \param baseAddress is the base address of the TIMER_D module.
//!
//! \return Majority vote of timer count value
//
//*****************************************************************************
extern uint16_t Timer_D_getCounterValue(uint16_t baseAddress);

//*****************************************************************************
//
// The Timer_D_configureContinuousMode() API has been deprecated. Instead
// please use the Timer_D_initContinuousMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_configureContinuousMode(uint16_t baseAddress,
                                            uint16_t clockSource,
                                            uint16_t clockSourceDivider,
                                            uint16_t clockingMode,
                                            uint16_t timerInterruptEnable_TDIE,
                                            uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_D_configureUpMode() API has been deprecated. Instead please use
// the Timer_D_initUpMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_configureUpMode(uint16_t baseAddress,
                                    uint16_t clockSource,
                                    uint16_t clockSourceDivider,
                                    uint16_t clockingMode,
                                    uint16_t timerPeriod,
                                    uint16_t timerInterruptEnable_TDIE,
                                    uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                    uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_D_configureUpDownMode() API has been deprecated. Instead please
// use the Timer_D_initUpDownMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_configureUpDownMode(uint16_t baseAddress,
                                        uint16_t clockSource,
                                        uint16_t clockSourceDivider,
                                        uint16_t clockingMode,
                                        uint16_t timerPeriod,
                                        uint16_t timerInterruptEnable_TDIE,
                                        uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                                        uint16_t timerClear);
#endif

//*****************************************************************************
//
// The Timer_D_initCapture() API has been deprecated. Instead please use the
// Timer_D_initCaptureMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_initCapture(uint16_t baseAddress,
                                uint16_t captureRegister,
                                uint16_t captureMode,
                                uint16_t captureInputSelect,
                                uint16_t synchronizeCaptureSource,
                                uint16_t captureInterruptEnable,
                                uint16_t captureOutputMode,
                                uint8_t channelCaptureMode);
#endif

//*****************************************************************************
//
// The Timer_D_initCompare() API has been deprecated. Instead please use the
// Timer_D_initCompareMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_initCompare(uint16_t baseAddress,
                                uint16_t compareRegister,
                                uint16_t compareInterruptEnable,
                                uint16_t compareOutputMode,
                                uint16_t compareValue);
#endif

//*****************************************************************************
//
// The Timer_D_generatePWM() API has been deprecated. Instead please use the
// Timer_D_outputPWM() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_generatePWM(uint16_t baseAddress,
                                uint16_t clockSource,
                                uint16_t clockSourceDivider,
                                uint16_t clockingMode,
                                uint16_t timerPeriod,
                                uint16_t compareRegister,
                                uint16_t compareOutputMode,
                                uint16_t dutyCycle);
#endif

//*****************************************************************************
//
// The Timer_D_configureHighResGeneratorInRegulatedMode() API has been
// deprecated. Instead please use the
// Timer_D_initHighResGeneratorInRegulatedMode() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_configureHighResGeneratorInRegulatedMode(
    uint16_t baseAddress,
    uint16_t clockSource,
    uint16_t clockSourceDivider,
    uint16_t clockingMode,
    uint8_t highResClockMultiplyFactor,
    uint8_t highResClockDivider);
#endif

//*****************************************************************************
//
// The Timer_D_combineTDCCRToGeneratePWM() API has been deprecated. Instead
// please use the Timer_D_combineTDCCRToOuputPWM() API.
//
//*****************************************************************************
#ifndef DEPRECATED
extern void Timer_D_combineTDCCRToGeneratePWM(uint16_t baseAddress,
                                              uint16_t clockSource,
                                              uint16_t clockSourceDivider,
                                              uint16_t clockingMode,
                                              uint16_t timerPeriod,
                                              uint16_t combineCCRRegistersCombination,
                                              uint16_t compareOutputMode,
                                              uint16_t dutyCycle1,
                                              uint16_t dutyCycle2);
#endif

//*****************************************************************************
//
// The following are deprecated APIs.
//
//*****************************************************************************
#define TIMER_D_configureHighResGeneratorInFreeRunningMode                    \
    Timer_D_initHighResGeneratorInFreeRunningMode

//*****************************************************************************
//
// The following are deprecated APIs.
//
//*****************************************************************************
#define TIMER_D_DisableHighResGeneratorForceON                                \
    Timer_D_disableHighResGeneratorForceON

//*****************************************************************************
//
// The following are deprecated APIs.
//
//*****************************************************************************
#define TIMER_D_EnableHighResGeneratorForceON                                 \
    Timer_D_enableHighResGeneratorForceON

//*****************************************************************************
//
// The following are deprecated API names. These were updated to new names to
// add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define TIMER_D_startCounter                               Timer_D_startCounter
#define TIMER_D_initContinuousMode                   Timer_D_initContinuousMode
#define TIMER_D_configureContinuousMode         Timer_D_configureContinuousMode
#define TIMER_D_initUpMode                                   Timer_D_initUpMode
#define TIMER_D_configureUpMode                         Timer_D_configureUpMode
#define TIMER_D_initUpDownMode                           Timer_D_initUpDownMode
#define TIMER_D_configureUpDownMode                 Timer_D_configureUpDownMode
#define TIMER_D_initCaptureMode                         Timer_D_initCaptureMode
#define TIMER_D_initCapture                                 Timer_D_initCapture
#define TIMER_D_initCompareMode                         Timer_D_initCompareMode
#define TIMER_D_initCompare                                 Timer_D_initCompare
#define TIMER_D_enableTimerInterrupt               Timer_D_enableTimerInterrupt
#define TIMER_D_enableHighResInterrupt           Timer_D_enableHighResInterrupt
#define TIMER_D_disableTimerInterrupt             Timer_D_disableTimerInterrupt
#define TIMER_D_disableHighResInterrupt         Timer_D_disableHighResInterrupt
#define TIMER_D_getTimerInterruptStatus         Timer_D_getTimerInterruptStatus
#define TIMER_D_enableCaptureCompareInterrupt                                 \
    Timer_D_enableCaptureCompareInterrupt
#define TIMER_D_disableCaptureCompareInterrupt                                \
    Timer_D_disableCaptureCompareInterrupt
#define TIMER_D_getCaptureCompareInterruptStatus                              \
    Timer_D_getCaptureCompareInterruptStatus
#define TIMER_D_getHighResInterruptStatus     Timer_D_getHighResInterruptStatus
#define TIMER_D_clear                                             Timer_D_clear
#define TIMER_D_clearHighResInterruptStatus Timer_D_clearHighResInterruptStatus
#define TIMER_D_getSynchronizedCaptureCompareInput                            \
    Timer_D_getSynchronizedCaptureCompareInput
#define TIMER_D_getOutputForOutputModeOutBitValue                             \
    Timer_D_getOutputForOutputModeOutBitValue
#define TIMER_D_getCaptureCompareCount           Timer_D_getCaptureCompareCount
#define TIMER_D_getCaptureCompareLatchCount Timer_D_getCaptureCompareLatchCount
#define TIMER_D_getCaptureCompareInputSignal                                  \
    Timer_D_getCaptureCompareInputSignal
#define TIMER_D_setOutputForOutputModeOutBitValue                             \
    Timer_D_setOutputForOutputModeOutBitValue
#define TIMER_D_outputPWM                                     Timer_D_outputPWM
#define TIMER_D_generatePWM                                 Timer_D_generatePWM
#define TIMER_D_stop                                               Timer_D_stop
#define TIMER_D_setCompareValue                         Timer_D_setCompareValue
#define TIMER_D_clearTimerInterruptFlag         Timer_D_clearTimerInterruptFlag
#define TIMER_D_clearCaptureCompareInterruptFlag                              \
    Timer_D_clearCaptureCompareInterruptFlag
#define TIMER_D_initHighResGeneratorInFreeRunningMode                         \
    Timer_D_initHighResGeneratorInFreeRunningMode
#define TIMER_D_initHighResGeneratorInRegulatedMode                           \
    Timer_D_initHighResGeneratorInRegulatedMode
#define TIMER_D_configureHighResGeneratorInRegulatedMode                      \
    Timer_D_configureHighResGeneratorInRegulatedMode
#define TIMER_D_combineTDCCRToOutputPWM         Timer_D_combineTDCCRToOutputPWM
#define TIMER_D_combineTDCCRToGeneratePWM     Timer_D_combineTDCCRToGeneratePWM
#define TIMER_D_selectLatchingGroup                 Timer_D_selectLatchingGroup
#define TIMER_D_selectCounterLength                 Timer_D_selectCounterLength
#define TIMER_D_initCompareLatchLoadEvent     Timer_D_initCompareLatchLoadEvent
#define TIMER_D_disableHighResFastWakeup       Timer_D_disableHighResFastWakeup
#define TIMER_D_enableHighResFastWakeup         Timer_D_enableHighResFastWakeup
#define TIMER_D_disableHighResClockEnhancedAccuracy                           \
    Timer_D_disableHighResClockEnhancedAccuracy
#define TIMER_D_enableHighResClockEnhancedAccuracy                            \
    Timer_D_enableHighResClockEnhancedAccuracy
#define TIMER_D_disableHighResGeneratorForceON                                \
    Timer_D_disableHighResGeneratorForceON
#define TIMER_D_enableHighResGeneratorForceON                                 \
    Timer_D_enableHighResGeneratorForceON
#define TIMER_D_selectHighResCoarseClockRange                                 \
    Timer_D_selectHighResCoarseClockRange
#define TIMER_D_selectHighResClockRange         Timer_D_selectHighResClockRange
#define TIMER_D_getCounterValue                         Timer_D_getCounterValue
#endif

//*****************************************************************************
//
// The following are deprecated struct names. These were updated to new names
// to add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define TIMER_D_initUpModeParam                         Timer_D_initUpModeParam
#define TIMER_D_initCompareModeParam               Timer_D_initCompareModeParam
#define TIMER_D_initContinuousModeParam         Timer_D_initContinuousModeParam
#define TIMER_D_initUpDownModeParam                 Timer_D_initUpDownModeParam
#define TIMER_D_initHighResGeneratorInRegulatedModeParam                      \
    Timer_D_initHighResGeneratorInRegulatedModeParam
#define TIMER_D_combineTDCCRToOutputPWMParam                                  \
    Timer_D_combineTDCCRToOutputPWMParam
#define TIMER_D_initCaptureModeParam               Timer_D_initCaptureModeParam
#define TIMER_D_outputPWMParam                           Timer_D_outputPWMParam
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_TIMER_D_H__
//Released_Version_4_20_00
